src/main/resources/requests/all-users-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://alex.ru/soapdemo/DTO">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllUsersRequest>
        </gs:getAllUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>